<div class="test jumbotron">
	<hr>
	<div class="row-fluid marketing">
		<input type="text" id="step1" name="name" value="">

		<input type="text" id="step2" name="name" value="">

		<div id="step3" class="span6">
			<p>
				Ме­тод map() вы­зы­ва­ет функ­цию точ­но так же, как и ме­тод forEach(). Од­на­ко функ­
				ция, пе­ре­да­вае­мая ме­то­ду map(), долж­на воз­вра­щать зна­че­ние. Об­ра­ти­те вни­ма­
				ние, что map() воз­вра­ща­ет но­вый мас­сив: он не из­ме­ня­ет ис­ход­ный мас­сив. Ес­ли
				ис­ход­ный мас­сив яв­ля­ет­ся раз­ре­жен­ным, воз­вра­щае­мый мас­сив так­же бу­дет
				раз­ре­жен­ным: он бу­дет иметь ту же са­мую дли­ну и те же са­мые от­сут­ст­вую­щие
				эле­мен­ты.
			</p>
		</div>

		<div id="cust">
			<p>
				Ме­тод map() вы­зы­ва­ет функ­цию точ­но так же, как и ме­тод forEach(). Од­на­ко функ­
				ция, пе­ре­да­вае­мая ме­то­ду map(), долж­на воз­вра­щать зна­че­ние. Об­ра­ти­те вни­ма­
				ние, что map() воз­вра­ща­ет но­вый мас­сив: он не из­ме­ня­ет ис­ход­ный мас­сив. Ес­ли
				ис­ход­ный мас­сив яв­ля­ет­ся раз­ре­жен­ным, воз­вра­щае­мый мас­сив так­же бу­дет
				раз­ре­жен­ным: он бу­дет иметь ту же са­мую дли­ну и те же са­мые от­сут­ст­вую­щие
				эле­мен­ты.
			</p>
		</div>

		<i class="help fa fa-question" aria-hidden="true"></i>
		<div id="bada">
			<p>
				Ме­тод map() вы­зы­ва­ет функ­цию точ­но так же, как и ме­тод forEach(). Од­на­ко функ­
				ция, пе­ре­да­вае­мая ме­то­ду map(), долж­на воз­вра­щать зна­че­ние. Об­ра­ти­те вни­ма­
				ние, что map() воз­вра­ща­ет но­вый мас­сив: он не из­ме­ня­ет ис­ход­ный мас­сив. Ес­ли
				ис­ход­ный мас­сив яв­ля­ет­ся раз­ре­жен­ным, воз­вра­щае­мый мас­сив так­же бу­дет
				раз­ре­жен­ным: он бу­дет иметь ту же са­мую дли­ну и те же са­мые от­сут­ст­вую­щие
				эле­мен­ты.
			</p>
		</div>

	</div>
</div>
